{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "return_sequences": false, "dropout": 0.0, "unroll": false, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_constraint": null, "implementation": 0, "dtype": "float32", "trainable": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "go_backwards": false, "recurrent_dropout": 0.0, "return_state": false, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "batch_input_shape": [null, 7, 12], "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_constraint": null, "units": 128, "recurrent_regularizer": null}}, {"class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "trainable": true, "n": 4}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "return_sequences": true, "dropout": 0.0, "unroll": false, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_constraint": null, "implementation": 0, "trainable": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "recurrent_dropout": 0.0, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "go_backwards": false, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "return_state": false, "recurrent_constraint": null, "units": 128, "recurrent_regularizer": null}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "units": 12}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "keras_version": "2.0.8", "backend": "tensorflow"}